app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists"
---
    def index
        @artist=Artist.all

INSERT INTO "artists" ("name", "dob", "gender", "address", "first_release_year", "no_of_albums_released", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
    def create
        @artist=Artist.new(artist_params)
        if @artist.save

UPDATE "artists" SET "name" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["name", "aanbb"], ["updated_at", "2024-01-11 06:31:21.599699"], ["id", 1]]
---
    def update
        if @artist.update(artist_params)

SELECT "musics".* FROM "musics" WHERE "musics"."artist_id" = ?  [["artist_id", 1]]
DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 1]]
DELETE FROM "musics" WHERE "musics"."id" = ?  [["id", 1]]
---
    def destroy
        @music=Music.where(artist_id: @artist.id)
        @music.destroy_all
        if @artist.destroy

SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_artist
        @artist=Artist.find(params[:id])