app/controllers/musics_controller.rb

  def index
    @musics = Music.where(artist_id: @artist_id)
---
SELECT "musics".* FROM "musics" WHERE "musics"."artist_id" = ?  [["artist_id", 1]]

  def create
    @music=Music.new(music_params)
    if @music.save
---
INSERT INTO "musics" ("title", "album_name", "genre", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "bbbb"], ["album_name", "bbb"], ["genre", "bbb"], ["created_at", "2024-01-12 04:22:59.377681"], ["updated_at", "2024-01-12 04:22:59.377681"], ["artist_id", 2]]

  def update

    if @music.update(music_params)
---
UPDATE "musics" SET "genre" = ?, "updated_at" = ? WHERE "musics"."id" = ?  [["genre", "classic"], ["updated_at", "2024-01-12 06:02:53.182791"], ["id", 3]]

  def destroy
    if @music.destroy
---
DELETE FROM "musics" WHERE "musics"."id" = ?  [["id", 2]]

  def set_music
    @music = Music.find(params[:id])
---
SELECT "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def set_artist
    @artist = Artist.find(params[:artist_id])
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]