app/controllers/user_controller.rb

INSERT INTO "users" ("email", "first_name", "last_name", "phone", "dob", "gender", "address", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "Sagark"], ["updated_at", "2024-01-11 10:56:08.300863"], ["id", 1]]
---
  def update
    @user=User.find(params[:id])
    if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 4]]
---
  def destroy
    @user=User.find(params[:id])
    if @user.destroy